# Вывод значений
print(5, 8, 6)

# Задание и вывод значения переменной n
n = 5
print(n)

# Задание и вывод значения переменной None (когда нет значения)
m = None
print(m)

# Вывод переменной с точкой
k = 1.89
print(k)

# Вывод переменной в виде строки
n = 'ffaae'
n1 = "ffsdf"
print(n)
print(n1)

# Вывод типа переменной (int в данном случае)
n = 5
print(type(n))
# или str в данном случае
n = 'dfwdf'
print(type(n))
# или str в данном случае
n='fd"wq"sdf'
print(n)


# Многострочное комментирование через """ тройные кавычки
print(5)
print(5)
print(5)

"""
print(5, 8)
print(5)
print(5, 9)
"""

# интерполяция строк
a = 5
b = 5.89
c = 'hello'

print(a, ' - ', b, ' - ', c)
print(f"{a} - {b} - {c}")
print("{} - {} - {}".format(a,b,c))

# ввод данных
# print('Введите первое число:')
# a = input()
# print(a)

# b = input('Введите второе число: ')

# Сумма двух чисел
# print(a, '+', b, '=', a + b)

# Приведение типов
c = 5.89
print(c)
print(type(c))
c = str(c)
print(c + '89')
print(type(c))
